app/controllers/books_controller.rb

INSERT INTO "books" ("Cena_sprzedazy", "Cena_zakupu", "ISBN", "Ilosc_egzemplarzy", "Nr_rachunku", "Rok_wydania", "Stawka_VAT", "Uwagi", "autor", "created_at", "index", "tytul", "updated_at", "wydawnictwo") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save